import time
from termcolor import colored

text = "Всім українцям, розкиданим по світу через війну, присвячується..."

for i in text:
    time.sleep(0.09)
    print(f"{colored(i, color='red', attrs=['bold'])}", end='', flush=True)



import time

txt = f"""

Програма The Terminal базується  на реальній історії.

Мехран Карімі Нассері, іранський біженець, прожив 18 років (з 1988 по 2006) в терміналі 1 аеропорту Шарль де Голль у Парижі. 
Нассері був змушений покинути Іран через політичні переслідування. Він мав намір поїхати до Великобританії, але його паспорт був викрадений під час подорожі. Без документів він не міг в'їхати до жодної країни і був змушений жити в аеропорту.

Нассері спав на лавці, їв у закладах харчування в терміналі і читав книги. Він подружився з аеропортовим персоналом і пасажирами. Завдяки пожертвам він зміг купити собі телевізор, радіо та інші речі, щоб зробити своє життя більш комфортним.

У 2006 році Нассері був госпіталізований з невідомою хворобою. Після лікування його розмістили в притулку для бездомних у Парижі. Він отримав бельгійський паспорт і деякий час жив у цій країні.

У 2022 році Нассері повернувся в аеропорт Шарль де Голль. Він витратив всі свої гроші і знову опинився бездомним.

12 листопада 2022 року Мехран Карімі Нассері помер від серцевого нападу в терміналі 2F аеропорту Шарль де Голль. Саме у 2022 році,коли мільони українок та українців вимушені були покинути свої домівки і рятувати своє життя і дітей в інших країнах по всьому світу.

Історія Мехрана Карімі Нассері стала символом бюрократичної тяганини та юридичних пасток, у які можуть потрапити біженці. Його життя в аеропорту протягом 18 років викликало дискусії щодо проблем біженців, бездомності та людської співчутливості.

Цінності, які вчить нас цінувати історія "Термінал":

Любов: Історія показує, як любов може об'єднати людей, навіть якщо вони з різних культур і країн.

Співчуття і доброта: Люди з різних верств суспільства об'єднуються, щоб допомогти нужденному.

Дружба: Завдяки цій історії ми вчимося, що дружба може виникнути навіть попри мовний бар'єр.

Свобода: Історія вчить нас цінувати маленькі радощі життя, навіть якщо ми можемо бути обмежені певним місцем.

Сім'я: Історія підкреслює, наскільки важлива для нас сім'я, навіть якщо ми можемо бути відірвані від неї.

Сила духу: Історія показує, що не можна здаватися, навіть коли стикаєшся з труднощами.

Оптимізм: Історія вчить нас ніколи не втрачати надію на краще, навіть перед лицем негараздів.

Віра в свої мрії: Історія показує, що не можна дозволяти обставинам завадити нам здійснити свої мрії. 

Нассері вів щоденник упродовж багатьох років, документуючи своє життя в аеропорту. I ось список людей, з якими він потоварищував протягом усіх цих років перед Вами. Ці люди готові розповісти більше про його життя в таких уникальних обставинах. Завдяки цім людям можливо детально реконстроювати події тих часів, написати сценарій оскароносного фільму і навчити людство бути уважним один до одного.

Ци хотіли б Ви поспілкуватись з цими людьми щоб дізнатися більше? 



"""

for i in txt:
    time.sleep(0.05)
    print(f"{i}", end='', flush=True)

